local ipairs = ipairs

local filenames = {
	"topics.txt",
	"Morrowind.cel",
	"tes3cn_Morrowind.ext.txt",
	"tes3cn_Tribunal.ext.txt",
	"tes3cn_Bloodmoon.ext.txt",
}

local forbids = arg[1] and arg or {
-- 注释结尾加" *"的表示跟nexus版本不一致
	function(line) local w, c = line:match "(伊德拉(..))" return c and c ~= "米" and c ~= "姆" and w end, -- 伊德拉米 | 伊德拉姆
	"伊德洛", -- 艾德拉
	"代德拉", -- 迪德拉
	"代德洛", -- 迪德拉
	"德拉君主", -- 德拉大君
	"阿凯", -- 阿尔凯 *
	"迪贝拉", -- 蒂贝拉 *
	"海尔辛", -- 希尔辛
	"玛拉凯斯", -- 马拉卡斯
	"谢尔格拉斯德", -- 谢尔格拉德
	function(line) local w, c = line:match "(谢尔格拉(..))" return c and c ~= "斯" and c ~= "德" and w end, -- 谢尔格拉斯 | 谢尔格拉德
	"勒多兰", -- 瑞多然 *
	"凯莫", -- 歧莫
	"岐莫", -- 歧莫
	"魔鳄兽", -- 迪德洛斯 *
	"灰烬汉", -- 灰烬可汗 *
	"灰烬汗", -- 灰烬可汗 *
	"古拉汉", -- 古拉可汗 *
	"古拉汗", -- 古拉可汗 *
	"距离武器", -- 远程武器
	"属性枯竭", -- 属性削弱 *
	"折扣的", -- 弱效的
	"素材", -- 材料 *
	"附了魔", -- 附魔 *
	"先祖墓室", -- 先祖墓穴 *
	"尼克斯犬", -- 尼克斯猎犬 *
	"术士之戒", -- 巫者之戒 *
	"仁慈者圣", -- 慈悲者圣

-- operative: 特工
-- agent: 密探
	"晋升为密探", -- 晋升为特工 *
	"税务局特工", -- 税务局密探 *
	"泰瓦尼特工", -- 泰瓦尼密探 *

-- keep: 堡(垒)
-- stronghold：堡垒(非兽人);城塞(兽人)
-- fort/fortress: 要塞
-- castle: 城堡
-- citadels: 都堡
	"帝国堡", -- 帝国要塞 *
	"禁酒堡", -- 禁酒要塞 *
	"雄蛾堡", -- 雄蛾要塞 *
	"堡垒事务", -- 要塞事务 *
	"达瑞斯堡", -- 达瑞斯要塞 *
	"霜蛾堡", -- 霜蛾要塞 *
	"月蛾堡", -- 月蛾要塞 *
	"红山要塞", -- 红山都堡
	"要塞垒", -- *
	"离宫", -- 神临 *
	"庙庭", -- 神殿庭院 *
	"巨市", -- 大集市 *

-- 音译不一致的
	"阿塔尤姆", -- 阿泰乌姆
	"多隆", -- 多罗姆 *
	"伽勒里昂", -- 伽勒良
	"哥尔", -- 格尔
	"格洛-", -- 格罗-
	"海勒", -- 赫勒 *
	"吉伽拉格", -- 杰盖拉格
	"卡拉威库斯", -- 克拉威库斯
	"勒丹亚", -- 瑞达尼亚 Redaynia *
	"勒斯丹", -- 瑞斯代尼亚 Resdaynia *
	"鲁因", -- 汝因
	"瓦提尼乌斯", -- 凡蒂尼乌斯
	"亚哈斯", -- 阿哈兹 *
	"伊纳斯·萨兰德斯", -- 伊纳斯·萨兰达斯

-- 间隔符和引号标准不一致的
	"九-趾", -- 九趾 *
	"舌-蟾", -- 舌蟾 *
	"隐-其-目", -- 隐其目 *
	"哈伊埃", -- 哈伊-埃 *
	"“友好”", -- 友好 *
	"“异客”", -- 异客 *
	"渡鸦索", -- “渡鸦”索 *

-- 以下是地名,空格分隔译成-分隔
	"泰尔·", -- 泰尔- *
	"阿莎·艾赫", -- 阿莎-艾赫 *
	"埃利斯·帕尔", -- 埃利斯-帕尔 *
	"奥德·迪德", -- 奥德-迪德 *
	"奥德·瑞达尼亚", -- 奥德-瑞达尼亚 *
	"奥德·索萨", -- 奥德-索萨 *
	"奥德·维洛提", -- 奥德-维洛提 *
	"巴尔·费尔", -- 巴尔-费尔 *
	"巴尔·乌尔", -- 巴尔-乌尔 *
	"大衮·费尔", -- 大衮-费尔 *
	"哈拉·奥德", -- 哈拉-奥德 *
	"玛尔·甘", -- 玛尔-甘 *
	"莫拉格·玛尔", -- 莫拉格-玛尔 *
	"纳尔·莫克", -- 纳尔-莫克 *
	"萨德瑞斯·莫拉", -- 萨德瑞斯-莫拉 *
	"苏尔·玛图尔", -- 苏尔-玛图尔 *
	"瓦达·萨姆西", -- 瓦达-萨姆西 *
	"乌拉斯·帕", -- 乌拉斯-帕 *
}

for _, filename in ipairs(filenames) do
	local i = 0
	for line in io.lines(filename) do
		i = i + 1
		for _, forbid in ipairs(forbids) do
			if type(forbid) == "string" then
				if line:find(forbid, 1, true) then
					print(filename .. "(" .. i .. "): " .. forbid)
				end
			else
				local r = forbid(line)
				if r then
					print(filename .. "(" .. i .. "): " .. r)
				end
			end
		end
	end
end

print "done!"
