local ipairs = ipairs

local filenames = {
	"topics.txt",
	"Morrowind.cel",
	"tes3cn_Morrowind.ext.txt",
	"tes3cn_Tribunal.ext.txt",
	"tes3cn_Bloodmoon.ext.txt",
}

local forbids = arg[1] and arg or {
--	"伊德拉", -- 艾德拉
	"伊德洛", -- 艾德拉
	"代德拉", -- 迪德拉
	"代德洛", -- 迪德拉
	"德拉君主", -- 德拉大君
	"阿凯", -- 阿尔凯
	"迪贝拉", -- 蒂贝拉
	"海尔辛", -- 希尔辛
	"玛拉凯斯", -- 马拉卡斯
	"谢尔格拉斯德", -- 谢尔格拉德
	"勒多兰", -- 瑞多然
	"凯莫", -- 歧莫
	"岐莫", -- 歧莫
	"魔鳄兽", -- 迪德拉斯
	"灰烬汉", -- 灰烬可汗
	"灰烬汗", -- 灰烬可汗
	"古拉汉", -- 古拉可汗
	"古拉汗", -- 古拉可汗
	"距离武器", -- 远程武器
	"折扣的", -- 弱效的
	"属性枯竭", -- 属性削弱
	"素材", -- 材料
	"附了魔", -- 附魔
	"巨市", -- 大集市
	"先祖墓室", -- 先祖墓穴
	"尼克斯犬", -- 尼克斯猎犬
	"术士之戒", -- 巫者之戒
	"仁慈者圣", -- 慈悲者圣

	"晋升为密探", -- 晋升为特工
	"税务局特工", -- 税务局密探
	"泰瓦尼特工", -- 泰瓦尼密探

-- keep: 堡(垒)
-- stronghold：堡垒(非兽人);城塞(兽人)
-- fort/fortress: 要塞
-- castle: 城堡
-- citadels: 都堡
	"帝国堡", -- 帝国要塞
	"禁酒堡", -- 禁酒要塞
	"雄蛾堡", -- 雄蛾要塞
	"堡垒事务", -- 要塞事务
	"达瑞斯堡", -- 达瑞斯要塞
	"霜蛾堡", -- 霜蛾要塞
	"月蛾堡", -- 月蛾要塞
	"红山要塞", -- 红山都堡
	"要塞垒",

	"亚哈斯", -- 阿哈兹
	"阿鲁因", -- 阿汝因
	"阿塔尤姆", -- 阿泰乌姆
	"格洛%-", -- 格罗-
	"哥尔%-", -- 格尔-
	"多隆", -- 多罗姆
	"伽勒里昂", -- 伽勒良
	"·海勒", -- ·赫勒
	"吉伽拉格", -- 杰盖拉格
	"勒丹亚", -- 瑞达尼亚 Redaynia
	"勒斯丹", -- 瑞斯代尼亚 Resdaynia

	"隐%-其%-目", -- 隐其目
	"九%-趾", -- 九趾
	"舌%-蟾", -- 舌蟾
	"哈伊埃", -- 哈伊-埃
	"“友好”的赌注", -- 友好的赌注
	"渡鸦索", -- “渡鸦”索

	"泰尔·", -- 泰尔-
	"奥德·迪德拉斯", -- 奥德-迪德拉斯
	"奥德·瑞达尼亚", -- 奥德-瑞达尼亚
	"奥德·索萨", -- 奥德-索萨
	"奥德·维洛提", -- 奥德-维洛提
	"巴尔·费尔", -- 巴尔-费尔
	"巴尔·乌尔", -- 巴尔-乌尔
	"阿莎·艾赫", -- 阿莎-艾赫
	"苏尔·玛图尔", -- 苏尔-玛图尔
	"大衮·费尔", -- 大衮-费尔
	"埃利斯·帕尔", -- 埃利斯-帕尔
	"纳尔·莫克", -- 纳尔-莫克
	"哈拉·奥德", -- 哈拉-奥德
	"玛尔·甘", -- 玛尔-甘
	"莫拉格·玛尔", -- 莫拉格-玛尔
	"瓦达·萨姆西", -- 瓦达-萨姆西
	"萨德瑞斯·莫拉", -- 萨德瑞斯-莫拉
	"乌拉斯·帕", -- 乌拉斯-帕
}

for _, filename in ipairs(filenames) do
	local i = 0
	for line in io.lines(filename) do
		i = i + 1
		for _, forbid in ipairs(forbids) do
			if line:find(forbid, 1) then
				print(filename .. "(" .. i .. "): " .. forbid)
			end
		end
	end
end

print "done!"
